dev/singleBuilding/of7_kOmegaSST/system/blockMeshDict_1
/*---------------------------------------------------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

zMax   1;

convertToMeters 1;
vertices
(
    (0. -0.01 0.)
    (0. -0.01 0.125)
    (0. -0.01 1.)
    (0. 0.01 0.)
    (0. 0.01 0.125)
    (0. 0.01 1.)
    (0.95 -0.01 0.)
    (0.95 -0.01 0.125)
    (0.95 -0.01 1.)
    (0.95 0.01 0.)
    (0.95 0.01 0.125)
    (0.95 0.01 1.)
    (1.05 -0.01 0.)
    (1.05 -0.01 0.125)
    (1.05 -0.01 1.)
    (1.05 0.01 0.)
    (1.05 0.01 0.125)
    (1.05 0.01 1.)
    (4. -0.01 0.)
    (4. -0.01 0.125)
    (4. -0.01 1.)
    (4. 0.01 0.)
    (4. 0.01 0.125)
    (4. 0.01 1.)
);

nX_upstream   40;
nX_building   20;
nX_downstream 100;


nZ_bot   30;
nZ_top   100;

blocks
(
    hex (0 6 9 3 1 7 10 4)  ($nX_upstream 1 $nZ_bot) simpleGrading (0.05 1 0.5)
    hex (12 18 21 15 13 19 22 16)  ($nX_downstream 1 $nZ_bot) simpleGrading (30 1 0.5)

    hex (1 7 10 4 2 8 11 5)  ($nX_upstream 1 $nZ_top) simpleGrading (0.05 1 5)
    hex (7 13 16 10 8 14 17 11)  ($nX_building 1 $nZ_top) simpleGrading (1 1 5)
    hex (13 19 22 16 14 20 23 17)  ($nX_downstream 1 $nZ_top) simpleGrading (30 1 5)
);
edges
(
);
boundary
(
    ground
   {
        type wall;
        faces
        (
            (0 3 9 6)
            (12 15 21 18)
        );
    }
    outlet
   {
        type patch;
        faces
        (
            (18 21 22 19)
            (19 22 23 20)
        );
    }
    sides_1
   {
        type empty;
        faces
        (
            (0 6 7 1)
            (1 7 8 2)
            (7 13 14 8)
            (12 18 19 13)
            (13 19 20 14)
        );
    }
    sides_2
   {
        type empty;
        faces
        (
            (3 4 10 9)
            (4 5 11 10)
            (10 11 17 16)
            (15 16 22 21)
            (16 17 23 22)
        );
    }
    inlet
   {
        type patch;
        faces
        (
            (1 4 3 0)
            (2 5 4 1)
        );
    }
    top
   {
        type wall;
        faces
        (
            (2 8 11 5)
            (8 14 17 11)
            (14 20 23 17)
        );
    }
    building
   {
        type wall;
        faces
        (
            (6 9 10 7)
            (7 10 16 13)
            (13 16 15 12)
        );
    }
);
mergePatchPairs
(
);
